__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            (None, 32, 32, 3)    0
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 15, 15, 32)   864         input_1[0][0]
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 15, 15, 32)   96          conv2d[0][0]
__________________________________________________________________________________________________
activation (Activation)         (None, 15, 15, 32)   0           batch_normalization[0][0]
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 13, 13, 32)   9216        activation[0][0]
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 13, 13, 32)   96          conv2d_1[0][0]
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 13, 13, 32)   0           batch_normalization_1[0][0]
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 13, 13, 64)   18432       activation_1[0][0]
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 13, 13, 64)   192         conv2d_2[0][0]
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 13, 13, 64)   0           batch_normalization_2[0][0]
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 6, 6, 64)     0           activation_2[0][0]
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 6, 6, 80)     5120        max_pooling2d[0][0]
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 6, 6, 80)     240         conv2d_3[0][0]
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 6, 6, 80)     0           batch_normalization_3[0][0]
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 4, 4, 192)    138240      activation_3[0][0]
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 4, 4, 192)    576         conv2d_4[0][0]
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 4, 4, 192)    0           batch_normalization_4[0][0]
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 1, 1, 192)    0           activation_4[0][0]
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 1, 1, 64)     12288       max_pooling2d_1[0][0]
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 1, 1, 64)     192         conv2d_8[0][0]
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 1, 1, 64)     0           batch_normalization_8[0][0]
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 1, 1, 48)     9216        max_pooling2d_1[0][0]
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 1, 1, 96)     55296       activation_8[0][0]
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 1, 1, 48)     144         conv2d_6[0][0]
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 1, 1, 96)     288         conv2d_9[0][0]
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 1, 1, 48)     0           batch_normalization_6[0][0]
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 1, 1, 96)     0           batch_normalization_9[0][0]
__________________________________________________________________________________________________
average_pooling2d (AveragePooli (None, 1, 1, 192)    0           max_pooling2d_1[0][0]
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 1, 1, 64)     12288       max_pooling2d_1[0][0]
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 1, 1, 64)     76800       activation_6[0][0]
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 1, 1, 96)     82944       activation_9[0][0]
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 1, 1, 32)     6144        average_pooling2d[0][0]
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 1, 1, 64)     192         conv2d_5[0][0]
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 1, 1, 64)     192         conv2d_7[0][0]
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 1, 1, 96)     288         conv2d_10[0][0]
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 1, 1, 32)     96          conv2d_11[0][0]
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 1, 1, 64)     0           batch_normalization_5[0][0]
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 1, 1, 64)     0           batch_normalization_7[0][0]
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 1, 1, 96)     0           batch_normalization_10[0][0]
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 1, 1, 32)     0           batch_normalization_11[0][0]
__________________________________________________________________________________________________
mixed0 (Concatenate)            (None, 1, 1, 256)    0           activation_5[0][0]
                                                                 activation_7[0][0]
                                                                 activation_10[0][0]
                                                                 activation_11[0][0]
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 1, 1, 64)     16384       mixed0[0][0]
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 1, 1, 64)     192         conv2d_15[0][0]
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 1, 1, 64)     0           batch_normalization_15[0][0]
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 1, 1, 48)     12288       mixed0[0][0]
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 1, 1, 96)     55296       activation_15[0][0]
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 1, 1, 48)     144         conv2d_13[0][0]
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 1, 1, 96)     288         conv2d_16[0][0]
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 1, 1, 48)     0           batch_normalization_13[0][0]
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 1, 1, 96)     0           batch_normalization_16[0][0]
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 1, 1, 256)    0           mixed0[0][0]
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 1, 1, 64)     16384       mixed0[0][0]
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 1, 1, 64)     76800       activation_13[0][0]
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 1, 1, 96)     82944       activation_16[0][0]
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 1, 1, 64)     16384       average_pooling2d_1[0][0]
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 1, 1, 64)     192         conv2d_12[0][0]
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 1, 1, 64)     192         conv2d_14[0][0]
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 1, 1, 96)     288         conv2d_17[0][0]
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 1, 1, 64)     192         conv2d_18[0][0]
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 1, 1, 64)     0           batch_normalization_12[0][0]
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 1, 1, 64)     0           batch_normalization_14[0][0]
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 1, 1, 96)     0           batch_normalization_17[0][0]
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 1, 1, 64)     0           batch_normalization_18[0][0]
__________________________________________________________________________________________________
mixed1 (Concatenate)            (None, 1, 1, 288)    0           activation_12[0][0]
                                                                 activation_14[0][0]
                                                                 activation_17[0][0]
                                                                 activation_18[0][0]
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 1, 1, 64)     18432       mixed1[0][0]
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 1, 1, 64)     192         conv2d_22[0][0]
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 1, 1, 64)     0           batch_normalization_22[0][0]
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 1, 1, 48)     13824       mixed1[0][0]
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 1, 1, 96)     55296       activation_22[0][0]
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 1, 1, 48)     144         conv2d_20[0][0]
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 1, 1, 96)     288         conv2d_23[0][0]
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 1, 1, 48)     0           batch_normalization_20[0][0]
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 1, 1, 96)     0           batch_normalization_23[0][0]
__________________________________________________________________________________________________
average_pooling2d_2 (AveragePoo (None, 1, 1, 288)    0           mixed1[0][0]
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 1, 1, 64)     18432       mixed1[0][0]
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 1, 1, 64)     76800       activation_20[0][0]
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 1, 1, 96)     82944       activation_23[0][0]
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 1, 1, 64)     18432       average_pooling2d_2[0][0]
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 1, 1, 64)     192         conv2d_19[0][0]
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 1, 1, 64)     192         conv2d_21[0][0]
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 1, 1, 96)     288         conv2d_24[0][0]
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 1, 1, 64)     192         conv2d_25[0][0]
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 1, 1, 64)     0           batch_normalization_19[0][0]
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 1, 1, 64)     0           batch_normalization_21[0][0]
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 1, 1, 96)     0           batch_normalization_24[0][0]
__________________________________________________________________________________________________
activation_25 (Activation)      (None, 1, 1, 64)     0           batch_normalization_25[0][0]
__________________________________________________________________________________________________
mixed2 (Concatenate)            (None, 1, 1, 288)    0           activation_19[0][0]
                                                                 activation_21[0][0]
                                                                 activation_24[0][0]
                                                                 activation_25[0][0]
__________________________________________________________________________________________________
avg_pool (GlobalAveragePooling2 (None, 288)          0           mixed2[0][0]
__________________________________________________________________________________________________
predictions (Dense)             (None, 10)           2890        avg_pool[0][0]
==================================================================================================
Total params: 995,946
Trainable params: 992,234
Non-trainable params: 3,712
__________________________________________________________________________________________________
